In [1]:
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

## Carregando os arquivos

In [42]:
## CSV
fatoDet0 = pd.read_csv('Processado/FatoDetalhes_DadosModelagem.csv',sep=';')
## TXT
fatoCab0 = pd.read_csv('Processado/FatoCabecalho_DadosModelagem.txt',sep='\t')
## EXCEL
dim0     = pd.read_excel('Processado/Dimensoes_DadosModelagem.xlsx')

## Vendo Fato Detalhes

In [43]:
fatoDet0.head()

   CupomID  ProdutoID  Quantidade Valor Desconto   Custo ValorLiquido
0    10308         69           1  2,12        0  1,8317       0,2883
1    10558         73           3  2,97        0  2,4057       0,5643
2    10259         37           1  4,37        0  3,7757       0,5943
3    11077         73           5  6,11   0,0605   5,838       0,2725
4    10752         69           3  6,57        0  5,3217       1,2483

In [44]:
fatoDet0.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2172 entries, 0 to 2171
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   CupomID       2172 non-null   int64
 1   ProdutoID     2172 non-null   int64
 2   Quantidade    2172 non-null   int64
 3   Valor         2172 non-null   object
 4   Desconto      2172 non-null   object
 5   Custo         2172 non-null   object
 6   ValorLiquido  2172 non-null   object
dtypes: int64(3), object(4)
memory usage: 118.9+ KB

In [45]:
fatoCab0.head()

,Data,ClienteID,FuncionarioID,ValorFrete,CupomID,EmpresaFrete,DataEntrega
0,22/03/2018,78,11,"12,45",11081,Freight Express,05/04/2018
1,21/11/2016,62,3,"20,01",10637,One Liners,24/11/2016
2,16/09/2017,64,3,"20,36",11019,One Liners,03/10/2017
3,02/07/2017,80,11,"20,53",10982,Freight Express,04/07/2017
4,16/09/2016,28,5,"20,61",10328,Ship for U,29/09/2016

In [47]:
datas = ['Data','DataEntrega']
for i in datas:
    fatoCab0[i] = pd.to_datetime(fatoCab0[i],format='%d/%m/%Y')

In [48]:
fatoCab0.head()

,Data,ClienteID,FuncionarioID,ValorFrete,CupomID,EmpresaFrete,DataEntrega
0,2018-03-22,78,11,"12,45",11081,Freight Express,2018-04-05
1,2016-11-21,62,3,"20,01",10637,One Liners,2016-11-24
2,2017-09-16,64,3,"20,36",11019,One Liners,2017-10-03
3,2017-07-02,80,11,"20,53",10982,Freight Express,2017-07-04
4,2016-09-16,28,5,"20,61",10328,Ship for U,2016-09-29

In [51]:
fatoCab0.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 836 entries, 0 to 835
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Data           836 non-null    datetime64[ns]
 1   ClienteID      836 non-null    int64
 2   FuncionarioID  836 non-null    int64
 3   ValorFrete     836 non-null    object
 4   CupomID        836 non-null    int64
 5   EmpresaFrete   836 non-null    object
 6   DataEntrega    836 non-null    datetime64[ns]
dtypes: datetime64[ns](2), int64(3), object(2)
memory usage: 45.8+ KB

In [49]:
dim0.head()

,ClienteID,Cliente,NomeContato,Endereco,Cidade,Pais,PaisCodigo,Regiao,CEP,Latitude,Longitude,Fax,Telefone
0,1,Eintrach GS,Albert von Einstein,Obere Str. 57,Berlin,Germany,DE,Europe,12209.0,52.401482,13.099724,030-0076545,030-0074321
1,2,La Tienda de la Esquina,Paco el Maco,Avda. de la Constitución 2222,Mexico City,Mexico,MX,North America,5021.0,19.631915,-99.133418,(5) 555-3745,(5) 555-4729
2,3,La Ropa Vieja,Sancho Panza,C/ Ritual de lo Habitual 2312,Mexico City,Mexico,MX,North America,5023.0,19.545652,-99.138955,NaN,(5) 555-3932
3,4,Dr Jims Trousers,Carl Montgomery,120 Hanover Sq.,London,UK,GB,Europe,NaN,51.541599,-0.224499,(171) 555-6750,(171) 555-7788
4,5,Urras Shop,Urra Gurra Aktersnurra,Berguvsvägen 8,Gothenburg,Sweden,SE,Europe,NaN,57.811813,12.226721,0921-12 34 67,0921-12 34 65

In [50]:
dim0.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 90 entries, 0 to 89
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ClienteID    90 non-null     int64
 1   Cliente      90 non-null     object
 2   NomeContato  90 non-null     object
 3   Endereco     90 non-null     object
 4   Cidade       90 non-null     object
 5   Pais         90 non-null     object
 6   PaisCodigo   90 non-null     object
 7   Regiao       90 non-null     object
 8   CEP          66 non-null     float64
 9   Latitude     90 non-null     float64
 10  Longitude    90 non-null     float64
 11  Fax          66 non-null     object
 12  Telefone     88 non-null     object
dtypes: float64(3), int64(1), object(9)
memory usage: 9.3+ KB